Autodesk.Revit.DB.BuiltInFailures.WallJoinFailures.FailedToChangeWallJointsTypeFailure
Some of the joints you have selected can only have one wall joint type, so these joints haven't been changed.

Autodesk.Revit.DB.BuiltInFailures.WallJoinFailures
Failures about WallJoin.